The Plan for staging is:
```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.epp.aws_iam_policy.read_write will be updated in-place
  ~ resource "aws_iam_policy" "read_write" {
        id          = "arn:aws:iam::512686554592:policy/epp-staging-s3-read-write"
        name        = "epp-staging-s3-read-write"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = "arn:aws:s3:::staging-elife-epp-data" -> [
                          + "arn:aws:s3:::staging-elife-epp-data",
                          + "arn:aws:s3:::staging-elife-epp-meca",
                          + "arn:aws:s3:::staging-elife-epp-pdf",
                        ]
                        # (3 unchanged attributes hidden)
                    },
                  ~ {
                      ~ Resource = "arn:aws:s3:::staging-elife-epp-data/*" -> [
                          + "arn:aws:s3:::staging-elife-epp-data/*",
                          + "arn:aws:s3:::staging-elife-epp-meca/*",
                          + "arn:aws:s3:::staging-elife-epp-pdf/*",
                        ]
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags        = {
            "Environment" = "staging"
            "Project"     = "epp"
        }
        # (5 unchanged attributes hidden)
    }

  # module.epp.aws_s3_bucket.meca_bucket will be created
  + resource "aws_s3_bucket" "meca_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "staging-elife-epp-meca"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "staging"
          + "Project"     = "epp"
        }
      + tags_all                    = {
          + "Environment" = "staging"
          + "Project"     = "epp"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.epp.aws_s3_bucket.pdf_bucket will be updated in-place
  ~ resource "aws_s3_bucket" "pdf_bucket" {
      + force_destroy               = false
        id                          = "staging-elife-epp-pdf"
        tags                        = {
            "Environment" = "staging"
            "Project"     = "epp"
        }
        # (9 unchanged attributes hidden)

      - timeouts {}

        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.
```